Merge remote-tracking branch 'origin/main' into cache_updates
